201409366/USB/stm32f103RBT6Board/applications/appNRF24L01.c
#include "nRF24L01.h"

extern rt_mq_t sendData_mq;
static unsigned char send_buffer[TX_PLOAD_WIDTH * 2];

void rt_appNRF24L01_thread_entry(void* parameter);

rt_err_t appNRF24L01Init(void){
	rt_err_t status;
	rt_thread_t init_thread;
	
	//status = nRF24L01_init(spi_device_name);
	status = RF24L01_Check();
	if(status == RT_EOK) {
		init_thread = rt_thread_create("appNRF24L01",
															 rt_appNRF24L01_thread_entry, RT_NULL,
															 2048, 8, 20);
		if (init_thread != RT_NULL)
			rt_thread_startup(init_thread);
		else
			status = RT_ERROR;
	}else
		status = RT_ERROR;
	
	return status;
}

void rt_appNRF24L01_thread_entry(void* parameter) {
	u8 status;	//用于判断接收/发送状态	
	rt_err_t result = RT_EOK;

	while(1) {
		
		result = rt_mq_recv(sendData_mq, &send_buffer[0], TX_PLOAD_WIDTH, RT_WAITING_FOREVER);
		if(result != RT_EOK) {
			rt_kprintf("recv mq error !");
			return;
		}
			
		
		RF24L01_TX_Mode();
		/*开始发送数据*/	
		status = RF24L01_Tx_Dat(&send_buffer[0]);
		
		/*判断发送状态*/
		switch(status)
		{
			case MAX_RT:
				rt_kprintf("success \r\n");
				//rt_thread_delay( RT_TICK_PER_SECOND*5);
				break;
			case ERROR:
				rt_kprintf("error \r\n");
				//rt_thread_delay( RT_TICK_PER_SECOND*15);
				break;
			case TX_DS:
				rt_kprintf("fail \r\n");	 		
				//rt_thread_delay(RT_TICK_PER_SECOND);
				break;  								
		}			   	       
	}	
}
